#pragma once

class Player;

class GameManager
{
public:

	//+++++++++++++++++++++++++++++++++++++++++
	// コンストラクタ
	//+++++++++++++++++++++++++++++++++++++++++
	GameManager();

public:

	//+++++++++++++++++++++++++++++++++++++++++
	// 生ポインタを返す
	//+++++++++++++++++++++++++++++++++++++++++
	Player* GetPlayer() const { return mp_player.get(); }

private:

	//+++++++++++++++++++++++++++++++++++++++++
	// プレイヤー（所有権はこのクラス）
	//+++++++++++++++++++++++++++++++++++++++++
	std::unique_ptr<Player>mp_player;

};