#pragma once

class TransitionController
{
public:

    //**********************************
    // フェード開始
    //**********************************
    void Start(float time);

    //**********************************
    // 更新
    //**********************************
    void Update(float deltaTime);

    //**********************************
    // 描画
    //**********************************
    void Draw() const;

    //**********************************
    // シーン切り替えタイミングかどうか
    //**********************************
    bool IsSwitchTiming() const;

    //**********************************
    // フェードイン開始
    //**********************************
    void StartFadeIn();

    //**********************************
    // フェード中かどうか
    //**********************************
    bool IsActive() const;

private:

    //**********************************
    // コントローラーの状態の列挙体
    //**********************************
    enum class State
    {
        None,       // 何もしてない
        FadeOut,    // フェードアウト中
        Switch,     // 切り替えタイミング
        FadeIn      // フェードイン中
    };

private:

    State m_state = State::None;    // 状態

    float m_time = 0.0f;   // フェード時間
    float m_timer = 0.0f;  // 経過時間
};